Revit 2027 API
ExternalResourceTypes.BuiltInExternalResourceTypes.DecalCutOut Property
 An external resource type representing Decal linked data for cut out opacity. This type is reserved for future expansion but not yet implemented.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalResourceType DecalCutOut { get; }
Public Shared ReadOnly Property DecalCutOut As ExternalResourceType
	Get
public:
static property ExternalResourceType^ DecalCutOut {
	ExternalResourceType^ get ();
}
static member DecalCutOut : ExternalResourceType with get
Property Value
ExternalResourceType
See Also
Reference
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace